{"/":{"title":"About","data":{"":"","-hello-im-danilo#👋 Hello! I'm Danilo":"I'm a 4th-year computer science and psychology student at Simon Fraser University in beautiful British Columbia, Canada. 🇨🇦I'm interested in 📊 data (particularly 🏈 sports analytics), ✏️ compiler design, 👁️‍🗨️ artificial intelligence, and 💸 financial technology.","-industry-experience#💼 Industry Experience":"Tegus\nSoftware Engineer (Aug 2023 - ) in Vancouver, BC\nSoftware Engineer Intern (Sep 2022 - Jan 2023) in Vancouver, BC\nDeveloped and improved an intelligent financial filing parser, resulting in significant time saved for equity research analysts\nBuilt a financial model data visualization platform for building data-driven dashboards\n\n\n\n\nCanalyst\nSoftware Engineer Intern (May 2021 - Dec 2021) in Vancouver, BC\nBuilt C# tooling to validate financial data for over 4000 models used by more than 500 investment professionals\nDeveloped WPF-based interfaces for financial statement processing and model quality checking\nQuickly diagnosed and resolved time-sensitive bugs for equity analysts during high-traffic usage periods\n\n\n\n\nInternational Parcel Service\nSoftware Engineer Intern (Nov 2018 - Feb 2019) in Delta, BC\nLed the design and development of a data transformation solution using Microsoft Excel and VBA\nDeveloped macros for converting spreadsheet data to a format importable into a shipment software\nDesigned an error handing system that reported incorrect and invalid input, saving time for clients","-education#📚 Education":"Simon Fraser University (Sep 2019 - Aug 2023)\nBachelors in Computer Science\nRelevant Coursework: Data Science, Linear Algebra, Calculus I/II, Discrete Mathematics I/II, Business Statistics, Cybersecurity, Computer Vision, Data Structures and Algorithms\nResearch: Personalized & Gamified Python Learning Platform under the supervision of Dr. Hazra Imran\n\n\nMinor in Psychology\nRelevant Coursework: Research Methods, Health Psychology, Abnormal Psychology\n\n\n\n\nUniversity of Michigan (Sep 2022 - Nov 2022)\nSports Analytics Certificate\nCoursework: Foundations of Sports Analytics, Models with Sports Data, Wearable Technologies, Introduction to Machine Learning in Sports Analytics"}},"/posts":{"title":"Blog","data":{"":""}},"/posts/jokic-td":{"title":"Nikola Jokić - MVP x3, in a row.","data":{"":"Nikola Jokić is an unstoppable force in today's NBA -- if anyone is doubting this, just take a look at his most recent performances:\nDate\tGame\tMIN\tPTS\tREB\tAST\tFG%\t3/3/2023\tDEN vs MEM\t35\t18\t18\t10\t70.0%\t2/28/2023\tDEN @ HOU\t28\t14\t11\t10\t63.6%\t2/26/2023\tDEN vs LAC\t42\t40\t17\t10\t66.7%\nHe's averaging a triple-double this season at an absolutely incredible FG% too -- 63.4% at the moment! The shots he takes, he makes. This isn't a case of stat-padding either, as the Denver Nuggets win every time he has a triple-double (25-0).The current NBA ladder has Jokić at #1, followed closely by Giannis Antetokoumnpo at #2, and Jayson Tatum at #3. It's interesting that Joel Embiid has been pushed out of the picture at the moment. However, we still have half a season left, so that's a conversation for another day.When comparing the top 3 MVP candidates, we see that the three are pretty neck-and-neck in PAR (Points + Assists + Rebounds).It's clear that in today's NBA, you have to be a great shooter, a great playmaker, and a great rebounder to be considered in the \"who's the best?\" conversation. Depending on who you ask, a great shooter is one of: someone who gets their shots in more often than not, someone who scores the most points, or most wisely, a combination of the two. Currently, Jokić is dominating in FG% among the top 3 MVP candidates:So what's left to compare? Wins -- the Nuggets are #1 in the Western Conference, while the Milwaukee Bucks are #1 in the Eastern Conference, followed closely by the Boston Celtics. It's clear that these players are MVP candidates for a reason.Further comparison? That would be on the difficult of competition, and game point differentials. However, it's important to remember that at the end of the day, basketball is a team sport. These players have a tremendous affect on the game, and a great positive impact on their team, but at the end, teams are what win basketball games.I hope to revisit this at various points in the season. There's still quite a lot of time left, but I don't believe that the standings will change all too much from now and when the regular season concludes.Why shouldn't Nikola Jokić get his third consecutive MVP? Well, no reason. He should."}},"/projects":{"title":"Projects","data":{"":"Here's some of my personal projects -- they are all open source and available on GitHub ↗ , however, not all of them are actively maintained.","personalized--gamified-learning-platform-academic-research-project#Personalized & Gamified Learning Platform (Academic Research Project)":"This was my research project that I did at the end of my third year of studies. It was an academic project that involved conducting a literature review and creating a personalized and gamified learning platform for students to learn about the basics of programming.This project was done under the supervision of Dr. Hazra Imran at Simon Fraser University. The project was written in JavaScript and used React & Firebase.","iode-programming-language#Iode (Programming Language)":"Iode is a programming language that compiles to JavaScript. There was a time when I was really into programming languages, and Iode was my attempt to create a language that I would like to use.\nAt one point, I worked on rewriting it in the D programming language, but I never finished it. It got as far as generating bytecode though! The JavaScript-target version of Iode still works rather well.","nba-salaries-data-science-experiment#nba-salaries (Data Science Experiment)":"A personal project that encompasses NBA data scraping, data cleaning, data transformation, and a neural network model.Something that stood out to me at first, but made more sense when I thought about it was the low(-er) correlation between salary and 3-pointers. When you think about it, players like Jokic + Gobert + Embiid hardly take that many 3-pointers, but are among the highest paid NBA players.This is the correlation matrix (2021-22 is the salary variable):","kite-html-templating-engine#kite (HTML Templating Engine)":"I originally made this when I was 14, back in 2015. I did not know about Angular / React / whatever popular framework was out there, so I made my own templating engine. It was super small (634b) and worked like a charm!To get it, one would just add this script to their HTML file:\n<script src=\"https://github.com/danilolekovic/kite.git\"></script>\nAnd then have a 'component' file like test.html:\n<p>Hello world!</p>\nAnd then, in the HTML file, you would have:\n<kite src=\"test.html\"></kite>\nAnd it would render the component in the HTML file.","pitfall-game#Pitfall (Game)":"This is a game I made in 2016. It's a clone of the classic Atari game, Pitfall. This was my term project for my game development class in high school.I used pygame and it had all of the features of the original, plus powerups and an in-game shop."}},"/tags/[tag]":{"title":"Tagged Posts","data":{"":""}}}